interface TreeData{
    [key: string]: string | TreeData
}
export const testData: TreeData = {

    "Test": {

        "Ствол": {
            "леваяВетка": "левая ветка",
            "праваяВетка": "правая ветка" 
        },
        // "среднийСтвол": {
        //     "праваяВетка": {
        //         "ветка вниз": "ветка-вниз"
    
        //     }
        // },
        "Верхушка": "Верхушка"
    },
    "TestEmpty": {

        
    },
    "water": {

        "Ствол": {
            "основная-левая-ветка": {
                "ветка вниз": "ветка-вниз33",
                "ветка-вверх": "ветка-вверх"
            },
            "праваяВетка": "праваяВетка" 
        },
        "средний-ствол": {
            "праваяВетка": {
                "ветка вниз": "ветка-вниз"
    
            }
        },
        "Верхушка": "Верхушка"
    },

    "chlorine": {

        "Ствол": {
            "леваяВетка": {
                "ветка вниз": "ветка-вниз",
                "ветка-вверх": "ветка-вверх555"
            },
            "праваяВетка": "праваяВетка" 
        },
        "среднийСтвол": {
            "праваяВетка": {
                "ветка вниз": "ветка-вниз"
    
            }
        },
        "Верхушка": "Верхушка"
    },

    "bromine": {

        "Ствол": {
            "леваяВетка": {
                "ветка вниз": "ветка-вниз",
                "ветка-вверх": "ветка-вверх"
            },
            "праваяВетка": "праваяВетка 999" 
        },
        "среднийСтвол": {
            "праваяВетка": {
                "ветка вниз": "ветка-вниз"
    
            }
        },
        "Верхушка": "Верхушка"
    }
}



// src/mockData.ts

// interface TreeData {
//     [key: string]: string | TreeData;
// }

// export const testData: TreeData = {
//     "water": {
//         "Ствол": {
//             "леваяВетка": {
//                 "ветка вниз": "ветка-вниз-лево",
//                 "ветка вверх": {
//                     "ветка очень высоко": "ветка-очень-высоко"
//                 }
//             },
//             "праваяВетка": {
//                 "праваяВетка 1": "ветка 1",
//                 "праваяВетка 2": {
//                     "ветка вниз": "ветка-вниз-право",
//                     "ветка вверх": "ветка-вверх-право"
//                 }
//             }
//         },
//         "СреднийСтвол": {
//             "праваяВетка": {
//                 "ветка вниз": "ветка-вниз-право-средний"
//             },
//             "леваяВетка": "ветка-лева-средний"
//         },
//         "Верхушка": "Верхушка воды"
//     },

//     "chlorine": {
//         "Ствол": {
//             "леваяВетка": {
//                 "ветка вниз": "ветка-вниз-лево-хлора",
//                 "ветка вверх": {
//                     "ветка развилки": {
//                         "дочка 1": "ветка-дочка-1",
//                         "дочка 2": "ветка-дочка-2"
//                     }
//                 }
//             },
//             "праваяВетка": {
//                 "праваяВетка 1": "ветка 1-хлора",
//                 "праваяВетка 2": "ветка 2-хлора"
//             }
//         },
//         "СреднийСтвол": {
//             "ветка вниз": {
//                 "ветка микро": "ветка-микро-хлора",
//                 "ветка макро": "ветка-макро-хлора"
//             },
//             "ветка вверх": "ветка вверх хлора"
//         },
//         "Верхушка": "Верхушка хлора"
//     },

//     "bromine": {
//         "Ствол": {
//             "леваяВетка": {
//                 "ветка вниз": "ветка-вниз-брома",
//                 "ветка вверх": "ветка-вверх-брома"
//             },
//             "праваяВетка": {
//                 "ветка вверх": {
//                     "ветка правой верхушки": {
//                         "ветка 1": "конечная ветка-1",
//                         "ветка 2": "конечная ветка-2"
//                     }
//                 },
//                 "ветка вниз": "ветка вниз-брома"
//             }
//         },
//         "СреднийСтвол": {
//             "ветка 1": "ветка 1-средний-бром",
//             "ветка 2": {
//                 "ветка 3": "ветка 3-средний-бром",
//                 "ветка 4": "ветка 4-средний-бром"
//             },
//         },
//         "Верхушка": "Верхушка брома с фруктами"
//     }
// };
